In [1]:
print("hello world")

hello world

**Step 1 Data Exploration & Leading**

In [40]:
#Importing dependencies

import pandas as pd

#mysql toolkit
import pymysql #this will work as adapter

from sqlalchemy import create_engine

#psql
import psycopg2

In [7]:
print(pd.__version__)

2.3.2

In [9]:
df=pd.read_csv('D:\my file\Python projects\datsets for projects\sql project\project walmart\walmart-10k-sales-datasets\Walmart.csv',encoding_errors='ignore')
df.head(2)

<>:1: SyntaxWarning: invalid escape sequence '\m'
<>:1: SyntaxWarning: invalid escape sequence '\m'
C:\Users\srees\AppData\Local\Temp\ipykernel_8916\1714452258.py:1: SyntaxWarning: invalid escape sequence '\m'
  df=pd.read_csv('D:\my file\Python projects\datsets for projects\sql project\project walmart\walmart-10k-sales-datasets\Walmart.csv',encoding_errors='ignore')

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48

In [10]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [12]:
#all duplicates

df.duplicated().sum()

np.int64(51)

In [14]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

np.int64(0)

In [15]:
df.shape

(10000, 11)

In [13]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [16]:
#Dropping all rows with missing records

df.dropna(inplace=True)

In [17]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [18]:
df.shape

(9969, 11)

In [19]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [20]:
df['unit_price']=df['unit_price'].str.replace('$','').astype(float)

df.head(2)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48

In [35]:
df.rename(columns={'unit_price':'unit_price$'},inplace=True)

In [36]:
df.head(2)

,invoice_id,Branch,City,category,unit_price$,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48

In [37]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price$', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [38]:
df['Total']=df['unit_price$']*df['quantity']

df.head(2)

,invoice_id,Branch,City,category,unit_price$,quantity,date,time,payment_method,rating,profit_margin,Total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40

In [43]:
#mysql
#host = localhost
#port = 3306
#user= root
#password = 'your_password'


#psql 
#host = localhost
#port = 5432
#user = postgres 
#password='admin123'

In [44]:
df.shape

(9969, 12)

In [62]:
from sqlalchemy import create_engine
from sqlalchemy.exc import OperationalError

engine_mysql = create_engine("mysql+pymysql://root:Downtownpalava%40123@localhost:3306/walmart_db")

try:
    # Attempt to connect to the database
    connection = engine_mysql.connect()
    print("✅ Successfully connected to MySQL!")
    # Close the connection after a successful test
    connection.close()
except OperationalError as e:
    # This block will be executed if the connection fails
    print(f"❌ Failed to connect to MySQL: {e}")

✅ Successfully connected to MySQL!

In [63]:
df.to_sql(name='walmart',con=engine_mysql,if_exists='append',index=False)

9969

In [64]:
#psql connection
#"mysql+pymysql://user:password@localhost:3306/db_name"
from sqlalchemy import create_engine
from sqlalchemy.exc import OperationalError

try:
    engine_psql = create_engine('postgresql+psycopg2://postgres:admin123@localhost:5432/walmart_db')
    connection = engine_psql.connect()
    print("✅ Connection to the database was successful!")
    connection.close()

except OperationalError as e:
    print(f"❌ An error occurred during connection: {e}")

✅ Connection to the database was successful!

In [69]:
df.to_sql(name='walmart',con=engine_psql,if_exists='append',index=False)

969

In [68]:
df.columns=df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price$', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')